Revit 2027 API
GridNodeLocation Enumeration
Location of a grid node relative to the face boundary. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GridNodeLocation
Public Enumeration GridNodeLocation
public enum class GridNodeLocation
type GridNodeLocation
Members
Member name | Value | Description
Boundary | 1
Exterior | 2
Interior | 0
See Also
Reference
Autodesk.Revit.DB Namespace